app/controllers/school_classes_controller.rb

  def edit
    @school_class = SchoolClass.find(paraks[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]